openfoam_exercises/channel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       15760;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       15800;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       15840;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       16040;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16000;
        startFace       16240;
    }
)

// ************************************************************************* //
