openfoam_exercises/channel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (2 0 0)
    (2 0.1 0)
    (0 0.1 0)
    (0 0 0.01)
    (2 0 0.01)
    (2 0.1 0.01)
    (0 0.1 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (200 40 1)
    simpleGrading (1 -0.2 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));   // left face — vertices 0,4,7,3
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));   // right face
    }
    topWall
    {
        type wall;
        faces ((3 7 6 2));
    }
    bottomWall
    {
        type wall;
        faces ((0 1 5 4));
    }
    frontAndBack
    {
        type empty;           // 2D magic word
        faces
        (
            (0 3 2 1)         // front face (z=0)
            (4 5 6 7)         // back face  (z=0.01)
        );
    }
);


// ************************************************************************* //
